# HasFabricationParts Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSystem..::..HasFabricationParts Property
MEPSystem Class See Also
---
Indicates if the system has one or more fabrication parts.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool HasFabricationParts { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HasFabricationParts As Boolean
	Get
```

Visual C++
---
```text
public:
property bool HasFabricationParts {
	bool get ();
}
```

# See Also
MEPSystem Class
Autodesk.Revit.DB Namespace